# Sum Salary by Title and Country (2.4.3) - Problem

Problem Statement: Create a pivot table to calculate the median of salary_year_avg for each company_name and job_country:

Filter the pivot table to only include 'Data Scientist' roles.
Then filter the pivot table to only include company_name with a median salary_year_avg greater than 200,000.
Display the first 10 rows of the resulting pivot table.

In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Datadataset 
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\Pedro\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [25]:
df_DS = df[df['job_title_short'] == 'Data Scientist'].copy()

pivot_table = df_DS.pivot_table(index=['company_name', 'job_country'], values='salary_year_avg', aggfunc='median')

filtered_pivot_table = pivot_table[pivot_table['salary_year_avg']>200000]

filtered_pivot_table.head(10)

                                   salary_year_avg
company_name        job_country
ACT                 Sudan                 225000.0
                    United States         225000.0
Abbott              United States         204000.0
Airbnb              United States         212500.0
Airtable            Sudan                 215500.0
                    United States         233500.0
Algo Capital Group  Sudan                 325000.0
                    United States         350000.0
Amadeus Search      United States         232500.0
Analog Devices, Inc United States         375000.0